Revit 2027 API
EnergyAnalysisOpening.OpeningType Property
 The analytical opening type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EnergyAnalysisOpeningType OpeningType { get; }
Public ReadOnly Property OpeningType As EnergyAnalysisOpeningType
	Get
public:
property EnergyAnalysisOpeningType OpeningType {
	EnergyAnalysisOpeningType get ();
}
member OpeningType : EnergyAnalysisOpeningType with get
Property Value
EnergyAnalysisOpeningType
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace